Tekla.Structures.Dialog.PluginFormBase
The PluginFormBase class is the base class for plug-in dialogs. The class extends
the FormBase class by adding communications with Tekla Structures.
The following example shows a situation where a class is created by using inheritance from the PluginFormBase. Due to limited space a
better example is located in the Open API Start-up Package in Extranet.  The name of the example is FormPlugin.
using System;
using System.Collections.Generic;
using System.Drawing;
using System.Text;
using System.Windows.Forms;
using Tekla.Structures.Datatype;
using Tekla.Structures.Dialog;
public class Example1 : PluginFormBase
{
private void InitializeComponent()
{
this.OkButton = new System.Windows.Forms.Button();
this.ModifyButton = new System.Windows.Forms.Button();
this.SuspendLayout();
//
// OkButton
//
this.structuresExtender.SetAttributeName(this.OkButton, null);
this.structuresExtender.SetAttributeTypeName(this.OkButton, null);
this.structuresExtender.SetBindPropertyName(this.OkButton, null);
this.OkButton.Name = "OkButton";
this.OkButton.Text = "OK";
this.OkButton.Click += new System.EventHandler(this.OkButton_Click);
//
// ModifyButton
//
this.structuresExtender.SetAttributeName(this.ModifyButton, null);
this.structuresExtender.SetAttributeTypeName(this.ModifyButton, null);
this.structuresExtender.SetBindPropertyName(this.ModifyButton, null);
this.ModifyButton.Name = "ModifyButton";
this.ModifyButton.Text = "Modify";
this.ModifyButton.Click += new System.EventHandler(this.ModifyButton_Click);
//
// Example1
//
this.structuresExtender.SetAttributeName(this, null);
this.structuresExtender.SetAttributeTypeName(this, null);
this.structuresExtender.SetBindPropertyName(this, null);
this.Controls.Add(this.ModifyButton);
this.Controls.Add(this.OkButton);
this.Name = "Example1";
this.ResumeLayout(false);
}
public Example1()
{
InitializeComponent();
}
private void OkButton_Click(object sender, EventArgs e)
{
this.Apply();
this.Close();
}
private void ModifyButton_Click(object sender, EventArgs e)
{
this.Modify();
}
private System.Windows.Forms.Button OkButton;
private System.Windows.Forms.Button ModifyButton;
}

Tekla.Structures.Dialog.PluginFormBase.AttributesLoadedFromModel
The AttributesLoadedFromModel event is triggered just after the attributes have been loaded
from the model into the dialog.

Tekla.Structures.Dialog.PluginFormBase.#ctor
Runs the FormBase constructor and loads the default .NET localization file (DotNetDialogStrings.ail).

Tekla.Structures.Dialog.PluginFormBase.SetTemporaryDataStorage(Tekla.Structures.DialogInternal.DialogDataStorage)
Sets the data storage class that communicates with Tekla Structures.
Handled by the Tekla.Structures.Dialog classes.
Storage: The data storage class.

Tekla.Structures.Dialog.PluginFormBase.GetTemporaryDataStorage(System.String)
Gets the data storage class that communicates with Tekla Structures.
Handled by the Tekla.Structures.Dialog classes.
Key: The data storage class.

Tekla.Structures.Dialog.PluginFormBase.SetModelDataStorage(Tekla.Structures.DialogInternal.DialogDataStorage)
Sets the data storage class that communicates with Tekla Structures.
Handled by the Tekla.Structures.Dialog classes.
Storage: The data storage class.

Tekla.Structures.Dialog.PluginFormBase.DoLoad
It raises the Load event.

Tekla.Structures.Dialog.PluginFormBase.DoInitializeForm
Once per Tekla Structures execution registers the dialog and its fields to the Tekla Structures
Object Dialog tree. Loads the initial values from the standard file.

Tekla.Structures.Dialog.PluginFormBase.ReloadForm
Reloads the dialog values.

Tekla.Structures.Dialog.PluginFormBase.Apply
The method to call when the Apply button is clicked. Stores the current dialog values locally and
to the Tekla Structures Object Dialog tree.

Tekla.Structures.Dialog.PluginFormBase.Modify
The method to call when the Modify button is clicked. Modifies the part that is currently selected in
Tekla Structures. First disables all the toggles in the object dialog tree, then enables the correct
ones by setting their values in WriteToDataStorage.

Tekla.Structures.Dialog.PluginFormBase.Create
The method to call when the Create button is clicked.
This method is a wrapper which delegates the request to the Modify() method.

Tekla.Structures.Dialog.PluginFormBase.Get
Gets the dialog values from the part that is currently selected in Tekla Structures.

Tekla.Structures.Dialog.PluginFormBase.LoadValuesPath(System.String)
Retrieves the full path for the file name. Called from LoadValues.
Override this function in order to change the default load path OR to add additional
actions on LoadValues.
FileName: The name of the file.
Returns: The full path together with the file name.

Tekla.Structures.Dialog.PluginFormBase.SaveValuesPath(System.String)
Retrieves the full path for the file name. Called from SaveValues.
Override this function in order to change the default save path OR to add additional
actions on SaveValues.
FileName: The name of the file.
Returns: The full path together with the file name.

Tekla.Structures.Dialog.PluginFormBase.ShowInTaskbar
Hides (shadows) the ShowInTaskbar property by setting the property to false.